//=====================================================================
//
// player.cppのヘッダファイル [player.h]
// Author : Kaito Iwasaki
// 
//=====================================================================
#ifndef _BULLET_H_
#define _BULLET_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "baseObject.h"
#include "main.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
#define MAX_BULLET		(256)

//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
typedef struct
{
	BASEOBJECT obj;
	bool bUsed;
	float fSpeed;
	float fDirection;
	float fDamage;
	D3DXVECTOR3 hitBoxSize;
}BULLET;

//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitBullet(void);
void UninitBullet(void);
void UpdateBullet(void);
void DrawBullet(void);
BULLET* GetBullet(void);
void SetBullet(D3DXVECTOR3 pos, float fSpeed, float fDirection);

#endif