//=====================================================================
//
// ゲーム画面 [game.cpp]
// Author : Kaito Iwasaki
// 
//=====================================================================

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "baseScene.h"
#include "game.h"
#include "input.h"
#include "sound.h"
#include "fade.h"
#include "font.h"

#include "player.h"
#include "enemy.h"
#include "bullet.h"
#include "enemybullet.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** グローバル変数 *****
// 
//*********************************************************************


//=====================================================================
// 初期化処理
//=====================================================================
void InitGame(void)
{
	InitFont();
	InitPlayer();
	InitBullet();
	InitEnemy();
	InitEnemyBullet();

	SetEnemy(ENEMYTYPE_000, D3DXVECTOR3(SCREEN_WIDTH / 2, SCREEN_HEIGHT / 2, 0.0f));
}

//=====================================================================
// 終了処理
//=====================================================================
void UninitGame(void)
{
	UninitFont();
	UninitPlayer();
	UninitBullet();
	UninitEnemy();
	UninitEnemyBullet();
}

//=====================================================================
// 更新処理
//=====================================================================
void UpdateGame(void)
{
	UpdateFont();
	UpdatePlayer();
	UpdateBullet();
	UpdateEnemy();
	UpdateEnemyBullet();

	if (GetKeyboardTrigger(DIK_RETURN))
	{
		SetFade(SCENE_GAME);
	}
}

//=====================================================================
// 描画処理
//=====================================================================
void DrawGame(void)
{
	DrawEnemy();
	DrawEnemyBullet();
	DrawBullet();
	DrawPlayer();
	DrawFont();
}