//=====================================================================
// 
// keylogger [keylogger.cpp]
// Author : Kaito Iwasaki
//
//=====================================================================

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "keylogger.h"
#include "input.h"
#include "util.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
#define KEYLOG_FILENAME		"data\\key_data.bin"

//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** グローバル変数 *****
// 
//*********************************************************************
bool g_aKeylog[MAX_FRAME_LOG][KEYLOGTYPE_MAX];

//=====================================================================
// 
// ***** 初期化処理 *****
// 
//=====================================================================
void InitKeyLogger(void)
{
	memset(&g_aKeylog[0][0], 0, sizeof(bool) * MAX_FRAME_LOG * KEYLOGTYPE_MAX);
}

//=====================================================================
// 
// ***** キー情報の保存処理 *****
// 
//=====================================================================
void LogKey(int nCountFrame)
{
	bool* pLog = &g_aKeylog[nCountFrame][0];

	if (nCountFrame >= MAX_FRAME_LOG) return;

	for (int nCount = 0; nCount < KEYLOGTYPE_MAX; nCount++, pLog++)
	{
		switch (nCount)
		{
		case KEYLOGTYPE_W:
			*pLog = GetKeyboardPress(DIK_W);
			break;

		case KEYLOGTYPE_S:
			*pLog = GetKeyboardPress(DIK_S);
			break;

		case KEYLOGTYPE_A:
			*pLog = GetKeyboardPress(DIK_A);
			break;

		case KEYLOGTYPE_D:
			*pLog = GetKeyboardPress(DIK_D);
			break;

		case KEYLOGTYPE_SPACE:
			*pLog = GetKeyboardPress(DIK_SPACE);
			break;
		}
	}
}

void SaveKeyLog(void)
{
	SaveBin(KEYLOG_FILENAME, &g_aKeylog[0][0], sizeof(bool), MAX_FRAME_LOG * KEYLOGTYPE_MAX);
}

//=====================================================================
// 
// ***** キー情報保存の停止処理 *****
// 
//=====================================================================
bool* GetKeyLog(void)
{
	return &g_aKeylog[0][0];
}