//========================================================================
//
// baseObject.cppのヘッダファイル [baseObject.h]
// Author : Kaito Iwasaki
// 
//========================================================================
#ifndef _UZAWA_H_
#define _UZAWA_H_

//*******************************************
// 
// ***** インクルードファイル *****
// 
//*******************************************
#include "main.h"
#include "baseObject.h"

//*******************************************
// 
// ***** 構造体 *****
// 
//*******************************************
typedef struct
{
	BASEOBJECT obj;
	float fSpeed;
}UZAWA;

//*******************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*******************************************
void InitUzawa(void);
void UninitUzawa(void);
void UpdateUzawa(void);
void DrawUzawa(void);

#endif

